<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"tts-10x-atj-staging","backend":"6f9b042137ddad289341a3c3ad2ffc410402f61d5fc89771b552f515d46f14e5","plan_job_ref":"Job Post Terraform plan to PR comment #296 at https://github.com/GSA-TTS/atj-platform/actions/runs/10776037709","plan_out_hash":"08e657542509f3e21339a85fdd0852bbe2d982e62a48889132b4c714ffab1436","plan_hash":"c070e98ca73c6ab857f1ea3df682db1e2c9dd099c2e0a00501a8113263adfb9f","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __tts-10x-atj-staging__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-app_E0D2137F will be created
+   resource "cloudfoundry_app" "tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-app_E0D2137F" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/atj-platform/server-doj:b1ebf0ba9f4de3f02ae36efd76148a8b005a4f3d"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-atj-staging-server-doj-app"
+       ports                           = (known after apply)
+       space                           = "132fc49b-e29e-40b3-8914-4233e4d4caf4"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = "5f2eddbb-1011-4cd8-89bf-a01048830b8b"
        }

+       service_binding {
+           service_instance = "3d5c5443-ae33-4bc6-a23b-2095fcba2fbe"
        }
+       service_binding {
+           service_instance = "f4d7b511-20cf-47d4-bf25-3bc2a848e8f4"
        }
    }

  # cloudfoundry_app.tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-app_0CAEC23C will be created
+   resource "cloudfoundry_app" "tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-app_0CAEC23C" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/atj-platform/server-kansas:b1ebf0ba9f4de3f02ae36efd76148a8b005a4f3d"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-atj-staging-server-kansas-app"
+       ports                           = (known after apply)
+       space                           = "132fc49b-e29e-40b3-8914-4233e4d4caf4"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = "d99c99cf-ecb3-4885-a5b2-8b95fc3bd1bd"
        }

+       service_binding {
+           service_instance = "b6df5c68-b06e-498c-a4ad-5a4a84d77fb1"
        }
+       service_binding {
+           service_instance = "097d925c-7aa5-489b-82df-d50abe38e284"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Post Terraform plan to PR comment #296](https://github.com/GSA-TTS/atj-platform/actions/runs/10776037709)